---
kind: property
id: P:Autodesk.Revit.DB.DimensionSegment.Prefix
source: html/703f9bb9-ef29-db04-6555-167682595bd0.htm
---
# Autodesk.Revit.DB.DimensionSegment.Prefix Property

The text shown before the segment's value.

## Syntax (C#)
```csharp
public string Prefix { get; set; }
```